Autodesk.Revit.DB.Structure.AnalyticalLoopType
Specifies kind of analytical model loop.
Since:
2013
Since:
2013

Autodesk.Revit.DB.Structure.AnalyticalLoopType.Void
Loops that are empty inside.
In the case of multiple nested loops, this will return a series of loops starting from second most external and every second heading into the most internal.
In the view returned loops are presented as external outline of openings.

Autodesk.Revit.DB.Structure.AnalyticalLoopType.Filled
Loops that are filled inside.
In the case of multiple nested loops, this will return the most external and every second loop going from external to internal.
In the view, returned loops are presented as external outline of solids.

Autodesk.Revit.DB.Structure.AnalyticalLoopType.Internal
An internal loop is a loop that is inside another loop.
In the case of multiple nested loops, this will return all loops except the most external loop.

Autodesk.Revit.DB.Structure.AnalyticalLoopType.External
Loops outside all other loops.
In case of multiple nested loops, this will return the most external loop.

Autodesk.Revit.DB.Structure.AnalyticalLoopType.All
All analytical loops of analytical model surface elements (floor, slab, wall).